-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/chadi/Dropbox/Applied-Economics/AK91/AK91/Analysis/Output/TableIV.log
  log type:  text
 opened on:  19 Sep 2024, 10:53:16

. 
. preserve

. keep if COHORT<20.30
(816,435 observations deleted)

. 
. local controls "RACE MARRIED SMSA NEWENG MIDATL ENOCENT WNOCENT SOATL ESOCENT WSOCENT MT"

. local qtr "QTR120-QTR129 QTR220-QTR229 QTR320-QTR329 YR20-YR28"

. 
. ** Col 1 3 5 7 ***
. reg  LWKLYWGE EDUC  YR20-YR28 

      Source |       SS           df       MS      Number of obs   =   247,199
-------------+----------------------------------   F(10, 247188)   =   5100.52
       Model |  17934.8419        10  1793.48419   Prob > F        =    0.0000
    Residual |  86918.1779   247,188  .351627821   R-squared       =    0.1710
-------------+----------------------------------   Adj R-squared   =    0.1710
       Total |   104853.02   247,198  .424166133   Root MSE        =    .59298

------------------------------------------------------------------------------
    LWKLYWGE | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        EDUC |   .0801595   .0003552   225.67   0.000     .0794633    .0808557
        YR20 |    .023484   .0053878     4.36   0.000     .0129241    .0340439
        YR21 |     .02899   .0053167     5.45   0.000     .0185693    .0394107
        YR22 |   .0232415   .0053556     4.34   0.000     .0127447    .0337383
        YR23 |   .0255564   .0053503     4.78   0.000     .0150699    .0360429
        YR24 |   .0264291    .005286     5.00   0.000     .0160686    .0367896
        YR25 |   .0308406   .0053234     5.79   0.000     .0204069    .0412743
        YR26 |   .0291043   .0053449     5.45   0.000     .0186284    .0395802
        YR27 |   .0271039   .0052807     5.13   0.000     .0167538     .037454
        YR28 |   .0242569   .0053348     4.55   0.000     .0138009     .034713
       _cons |    4.20996   .0056167   749.54   0.000     4.198951    4.220968
------------------------------------------------------------------------------

. reg  LWKLYWGE EDUC  YR20-YR28 AGEQ AGEQSQ 

      Source |       SS           df       MS      Number of obs   =   247,199
-------------+----------------------------------   F(12, 247186)   =   4250.99
       Model |  17936.8995        12  1494.74162   Prob > F        =    0.0000
    Residual |  86916.1203   247,186  .351622342   R-squared       =    0.1711
-------------+----------------------------------   Adj R-squared   =    0.1710
       Total |   104853.02   247,198  .424166133   Root MSE        =    .59298

------------------------------------------------------------------------------
    LWKLYWGE | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        EDUC |   .0801676   .0003553   225.65   0.000     .0794712    .0808639
        YR20 |  -.0247372   .0390484    -0.63   0.526    -.1012711    .0517967
        YR21 |  -.0263221   .0352192    -0.75   0.455    -.0953509    .0427067
        YR22 |  -.0359758   .0322031    -1.12   0.264     -.099093    .0271414
        YR23 |  -.0344738    .029489    -1.17   0.242    -.0922716    .0233239
        YR24 |  -.0313263    .026628    -1.18   0.239    -.0835164    .0208639
        YR25 |  -.0215758   .0233483    -0.92   0.355     -.067338    .0241863
        YR26 |   -.014863   .0193589    -0.77   0.443    -.0528059    .0230798
        YR27 |  -.0053281   .0145304    -0.37   0.714    -.0338072    .0231511
        YR28 |   .0063699   .0091343     0.70   0.486    -.0115331    .0242729
        AGEQ |   .1445517   .0675997     2.14   0.032      .012058    .2770454
      AGEQSQ |  -.0015423   .0007478    -2.06   0.039     -.003008   -.0000765
       _cons |   .8830288   1.516431     0.58   0.560    -2.089136    3.855193
------------------------------------------------------------------------------

. reg  LWKLYWGE EDUC  `controls' YR20-YR28

      Source |       SS           df       MS      Number of obs   =   247,199
-------------+----------------------------------   F(21, 247177)   =   3508.40
       Model |  24077.0055        21  1146.52407   Prob > F        =    0.0000
    Residual |  80776.0143   247,177  .326794217   R-squared       =    0.2296
-------------+----------------------------------   Adj R-squared   =    0.2296
       Total |   104853.02   247,198  .424166133   Root MSE        =    .57166

------------------------------------------------------------------------------
    LWKLYWGE | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        EDUC |   .0701188   .0003546   197.71   0.000     .0694237    .0708139
        RACE |  -.2979509   .0043445   -68.58   0.000     -.306466   -.2894358
     MARRIED |   .2928024   .0037449    78.19   0.000     .2854625    .3001423
        SMSA |  -.1343181   .0025648   -52.37   0.000    -.1393451   -.1292912
      NEWENG |  -.0327304   .0059551    -5.50   0.000    -.0444023   -.0210586
      MIDATL |  -.0131068   .0041124    -3.19   0.001    -.0211669   -.0050467
     ENOCENT |    .019752   .0040477     4.88   0.000     .0118187    .0276854
     WNOCENT |  -.1414501   .0054026   -26.18   0.000    -.1520391   -.1308612
       SOATL |  -.1037871   .0044282   -23.44   0.000    -.1124663   -.0951078
     ESOCENT |  -.2077824   .0058935   -35.26   0.000    -.2193334   -.1962313
     WSOCENT |  -.1514476   .0050699   -29.87   0.000    -.1613844   -.1415107
          MT |  -.1268479   .0067059   -18.92   0.000    -.1399914   -.1137044
        YR20 |   .0122181    .005195     2.35   0.019     .0020359    .0224002
        YR21 |   .0161059   .0051267     3.14   0.002     .0060578     .026154
        YR22 |   .0139765   .0051637     2.71   0.007     .0038559    .0240972
        YR23 |   .0166631   .0051587     3.23   0.001     .0065523     .026774
        YR24 |   .0173557   .0050966     3.41   0.001     .0073665    .0273448
        YR25 |   .0251024   .0051323     4.89   0.000     .0150431    .0351616
        YR26 |   .0238508    .005153     4.63   0.000      .013751    .0339506
        YR27 |   .0226915   .0050911     4.46   0.000     .0127132    .0326699
        YR28 |    .019031   .0051432     3.70   0.000     .0089505    .0291116
       _cons |   4.191501   .0072429   578.71   0.000     4.177305    4.205697
------------------------------------------------------------------------------

. reg  LWKLYWGE EDUC  `controls' YR20-YR28 AGEQ AGEQSQ 

      Source |       SS           df       MS      Number of obs   =   247,199
-------------+----------------------------------   F(23, 247175)   =   3203.50
       Model |  24078.2095        23  1046.87868   Prob > F        =    0.0000
    Residual |  80774.8103   247,175  .326791991   R-squared       =    0.2296
-------------+----------------------------------   Adj R-squared   =    0.2296
       Total |   104853.02   247,198  .424166133   Root MSE        =    .57166

------------------------------------------------------------------------------
    LWKLYWGE | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        EDUC |   .0701242   .0003547   197.69   0.000     .0694289    .0708194
        RACE |  -.2979528   .0043445   -68.58   0.000    -.3064679   -.2894376
     MARRIED |   .2927938   .0037449    78.18   0.000     .2854539    .3001337
        SMSA |  -.1343204   .0025648   -52.37   0.000    -.1393473   -.1292935
      NEWENG |  -.0327575   .0059551    -5.50   0.000    -.0444293   -.0210856
      MIDATL |  -.0131056   .0041123    -3.19   0.001    -.0211657   -.0050456
     ENOCENT |    .019735   .0040477     4.88   0.000     .0118016    .0276683
     WNOCENT |  -.1414505   .0054026   -26.18   0.000    -.1520395   -.1308615
       SOATL |  -.1037686   .0044283   -23.43   0.000     -.112448   -.0950893
     ESOCENT |  -.2077598   .0058935   -35.25   0.000     -.219311   -.1962087
     WSOCENT |  -.1513879   .0050702   -29.86   0.000    -.1613254   -.1414505
          MT |  -.1268288   .0067059   -18.91   0.000    -.1399723   -.1136853
        YR20 |  -.0178908    .037649    -0.48   0.635    -.0916818    .0559002
        YR21 |  -.0207608    .033957    -0.61   0.541    -.0873157    .0457941
        YR22 |   -.027055   .0310488    -0.87   0.384    -.0879098    .0337997
        YR23 |  -.0260209   .0284315    -0.92   0.360    -.0817458     .029704
        YR24 |  -.0244832   .0256729    -0.95   0.340    -.0748014    .0258349
        YR25 |  -.0134015   .0225105    -0.60   0.552    -.0575216    .0307185
        YR26 |  -.0088009   .0186642    -0.47   0.637    -.0453823    .0277804
        YR27 |  -.0016045   .0140087    -0.11   0.909    -.0290612    .0258521
        YR28 |   .0055357   .0088062     0.63   0.530    -.0117241    .0227955
        AGEQ |   .1162067   .0651707     1.78   0.075    -.0115261    .2439395
      AGEQSQ |  -.0012505    .000721    -1.73   0.083    -.0026636    .0001626
       _cons |   1.534505   1.461947     1.05   0.294    -1.330872    4.399882
------------------------------------------------------------------------------

. 
. 
. ** Col 2 4 6 8 ***
. ivregress 2sls LWKLYWGE YR20-YR28 (EDUC =  `qtr')

Instrumental-variables 2SLS regression            Number of obs   =    247,199
                                                  Wald chi2(10)   =     104.35
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1708
                                                  Root MSE        =     .59307

------------------------------------------------------------------------------
    LWKLYWGE | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        EDUC |   .0768557   .0150413     5.11   0.000     .0473752    .1063361
        YR20 |   .0217599   .0095191     2.29   0.022     .0031028     .040417
        YR21 |     .02776   .0077213     3.60   0.000     .0126265    .0428935
        YR22 |   .0220058    .007767     2.83   0.005     .0067827    .0372288
        YR23 |   .0246441   .0067731     3.64   0.000      .011369    .0379192
        YR24 |   .0257169   .0062014     4.15   0.000     .0135624    .0378715
        YR25 |   .0300778   .0063561     4.73   0.000     .0176201    .0425356
        YR26 |   .0286313   .0057629     4.97   0.000     .0173363    .0399264
        YR27 |   .0264814   .0059936     4.42   0.000     .0147342    .0382286
        YR28 |   .0239047   .0055712     4.29   0.000     .0129854    .0348241
       _cons |   4.248729   .1765461    24.07   0.000     3.902705    4.594753
------------------------------------------------------------------------------
Endogenous: EDUC
Exogenous:  YR20 YR21 YR22 YR23 YR24 YR25 YR26 YR27 YR28 QTR120 QTR121
            QTR122 QTR123 QTR124 QTR125 QTR126 QTR127 QTR128 QTR129 QTR220
            QTR221 QTR222 QTR223 QTR224 QTR225 QTR226 QTR227 QTR228 QTR229
            QTR320 QTR321 QTR322 QTR323 QTR324 QTR325 QTR326 QTR327 QTR328
            QTR329

. ivregress 2sls LWKLYWGE YR20-YR28 AGEQ AGEQSQ (EDUC =  `qtr')
note: QTR327 omitted because of collinearity.
note: QTR329 omitted because of collinearity.

Instrumental-variables 2SLS regression            Number of obs   =    247,199
                                                  Wald chi2(12)   =     104.08
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1023
                                                  Root MSE        =     .61707

------------------------------------------------------------------------------
    LWKLYWGE | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        EDUC |   .1310424    .033356     3.93   0.000     .0656659    .1964189
        YR20 |  -.1134064   .0709262    -1.60   0.110    -.2524193    .0256065
        YR21 |  -.1081954   .0649955    -1.66   0.096    -.2355842    .0191934
        YR22 |   -.103873    .055718    -1.86   0.062    -.2130781    .0053322
        YR23 |  -.0938903   .0495892    -1.89   0.058    -.1910834    .0033029
        YR24 |   -.080653   .0425868    -1.89   0.058    -.1641216    .0028156
        YR25 |  -.0573874   .0337871    -1.70   0.089     -.123609    .0088341
        YR26 |  -.0427072   .0271859    -1.57   0.116    -.0959905    .0105761
        YR27 |  -.0188154   .0175163    -1.07   0.283    -.0531468     .015516
        YR28 |   .0003555   .0102907     0.03   0.972     -.019814     .020525
        AGEQ |   .1409151   .0703863     2.00   0.045     .0029605    .2788697
      AGEQSQ |  -.0013605   .0007873    -1.73   0.084    -.0029035    .0001826
       _cons |   .1337519   1.652725     0.08   0.935    -3.105529    3.373033
------------------------------------------------------------------------------
Endogenous: EDUC
Exogenous:  YR20 YR21 YR22 YR23 YR24 YR25 YR26 YR27 YR28 AGEQ AGEQSQ QTR120
            QTR121 QTR122 QTR123 QTR124 QTR125 QTR126 QTR127 QTR128 QTR129
            QTR220 QTR221 QTR222 QTR223 QTR224 QTR225 QTR226 QTR227 QTR228
            QTR229 QTR320 QTR321 QTR322 QTR323 QTR324 QTR325 QTR326 QTR328

. ivregress 2sls LWKLYWGE YR20-YR28 `controls' (EDUC =  `qtr')

Instrumental-variables 2SLS regression            Number of obs   =    247,199
                                                  Wald chi2(21)   =   34596.79
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2294
                                                  Root MSE        =     .57173

------------------------------------------------------------------------------
    LWKLYWGE | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        EDUC |   .0668509   .0150912     4.43   0.000     .0372727    .0964291
        YR20 |   .0103977   .0098807     1.05   0.293    -.0089682    .0297636
        YR21 |   .0147392   .0081301     1.81   0.070    -.0011954    .0306738
        YR22 |    .012674   .0079265     1.60   0.110    -.0028617    .0282098
        YR23 |    .015665   .0069177     2.26   0.024     .0021064    .0292235
        YR24 |   .0165313   .0063613     2.60   0.009     .0040635    .0289992
        YR25 |   .0243016   .0063259     3.84   0.000      .011903    .0367001
        YR26 |   .0233091   .0057284     4.07   0.000     .0120817    .0345365
        YR27 |   .0220532    .005883     3.75   0.000     .0105227    .0335837
        YR28 |   .0186236    .005477     3.40   0.001     .0078888    .0293583
        RACE |  -.3055315    .035266    -8.66   0.000    -.3746516   -.2364114
     MARRIED |   .2941322   .0071915    40.90   0.000     .2800372    .3082272
        SMSA |  -.1362415   .0092426   -14.74   0.000    -.1543565   -.1181264
      NEWENG |  -.0340735   .0085978    -3.96   0.000     -.050925   -.0172221
      MIDATL |  -.0145956   .0080099    -1.82   0.068    -.0302948    .0011036
     ENOCENT |   .0173361   .0118655     1.46   0.144    -.0059199    .0405922
     WNOCENT |   -.143347   .0102902   -13.93   0.000    -.1635153   -.1231787
       SOATL |  -.1073946   .0172338    -6.23   0.000    -.1411723    -.073617
     ESOCENT |  -.2131811   .0256118    -8.32   0.000    -.2633794   -.1629828
     WSOCENT |  -.1551598   .0178727    -8.68   0.000    -.1901898   -.1201299
          MT |  -.1273555   .0071044   -17.93   0.000    -.1412798   -.1134311
       _cons |   4.232152   .1878152    22.53   0.000     3.864041    4.600263
------------------------------------------------------------------------------
Endogenous: EDUC
Exogenous:  YR20 YR21 YR22 YR23 YR24 YR25 YR26 YR27 YR28 RACE MARRIED SMSA
            NEWENG MIDATL ENOCENT WNOCENT SOATL ESOCENT WSOCENT MT QTR120
            QTR121 QTR122 QTR123 QTR124 QTR125 QTR126 QTR127 QTR128 QTR129
            QTR220 QTR221 QTR222 QTR223 QTR224 QTR225 QTR226 QTR227 QTR228
            QTR229 QTR320 QTR321 QTR322 QTR323 QTR324 QTR325 QTR326 QTR327
            QTR328 QTR329

. ivregress 2sls LWKLYWGE YR20-YR28 `controls' AGEQ AGEQSQ (EDUC =  `qtr')
note: QTR327 omitted because of collinearity.
note: QTR329 omitted because of collinearity.

Instrumental-variables 2SLS regression            Number of obs   =    247,199
                                                  Wald chi2(23)   =   33602.63
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2065
                                                  Root MSE        =     .58017

------------------------------------------------------------------------------
    LWKLYWGE | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        EDUC |   .1007154    .033412     3.01   0.003     .0352291    .1662017
        YR20 |  -.0679552   .0667052    -1.02   0.308     -.198695    .0627846
        YR21 |  -.0669484   .0610922    -1.10   0.273    -.1866869    .0527901
        YR22 |  -.0659501   .0528911    -1.25   0.212    -.1696148    .0377145
        YR23 |  -.0600534   .0470548    -1.28   0.202     -.152279    .0321723
        YR24 |  -.0525377   .0402207    -1.31   0.191    -.1313688    .0262935
        YR25 |  -.0342578   .0322615    -1.06   0.288    -.0974891    .0289736
        YR26 |  -.0247789   .0257554    -0.96   0.336    -.0752585    .0257007
        YR27 |  -.0095263    .016643    -0.57   0.567    -.0421461    .0230935
        YR28 |   .0024244   .0095615     0.25   0.800    -.0163158    .0211646
        RACE |  -.2270549   .0775561    -2.93   0.003     -.379062   -.0750478
     MARRIED |   .2803621   .0140991    19.89   0.000     .2527282    .3079959
        SMSA |  -.1163199   .0198307    -5.87   0.000    -.1551874   -.0774524
      NEWENG |  -.0201886   .0149986    -1.35   0.178    -.0495853     .009208
      MIDATL |   .0008336   .0157854     0.05   0.958    -.0301051    .0317723
     ENOCENT |   .0423374   .0250246     1.69   0.091    -.0067099    .0913846
     WNOCENT |  -.1236592   .0201894    -6.12   0.000    -.1632297   -.0840886
       SOATL |  -.0699707   .0371848    -1.88   0.060    -.1428515    .0029102
     ESOCENT |  -.1571901   .0555524    -2.83   0.005    -.2660707   -.0483095
     WSOCENT |  -.1165472   .0383975    -3.04   0.002    -.1918048   -.0412895
          MT |  -.1220908   .0085495   -14.28   0.000    -.1388476   -.1053341
        AGEQ |   .1170303   .0661453     1.77   0.077    -.0126122    .2466728
      AGEQSQ |  -.0011772    .000736    -1.60   0.110    -.0026198    .0002654
       _cons |    .999542   1.594612     0.63   0.531    -2.125839    4.124923
------------------------------------------------------------------------------
Endogenous: EDUC
Exogenous:  YR20 YR21 YR22 YR23 YR24 YR25 YR26 YR27 YR28 RACE MARRIED SMSA
            NEWENG MIDATL ENOCENT WNOCENT SOATL ESOCENT WSOCENT MT AGEQ
            AGEQSQ QTR120 QTR121 QTR122 QTR123 QTR124 QTR125 QTR126 QTR127
            QTR128 QTR129 QTR220 QTR221 QTR222 QTR223 QTR224 QTR225 QTR226
            QTR227 QTR228 QTR229 QTR320 QTR321 QTR322 QTR323 QTR324 QTR325
            QTR326 QTR328

. 
. restore

. log close
      name:  <unnamed>
       log:  C:/Users/chadi/Dropbox/Applied-Economics/AK91/AK91/Analysis/Output/TableIV.log
  log type:  text
 closed on:  19 Sep 2024, 10:53:28
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
