-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/chadi/Dropbox/Applied-Economics/AK91/AK91/Analysis/Output/TableVI.log
  log type:  text
 opened on:  19 Sep 2024, 10:53:40

. 
. preserve

. keep if COHORT>40.00
(576,708 observations deleted)

. 
. local controls "RACE MARRIED SMSA NEWENG MIDATL ENOCENT WNOCENT SOATL ESOCENT WSOCENT MT"

. local qtr "QTR120-QTR129 QTR220-QTR229 QTR320-QTR329 YR20-YR28"

. 
. ** Col 1 3 5 7 ***
. reg  LWKLYWGE EDUC  YR20-YR28 

      Source |       SS           df       MS      Number of obs   =   486,926
-------------+----------------------------------   F(10, 486915)   =   4396.64
       Model |  16795.7577        10  1679.57577   Prob > F        =    0.0000
    Residual |  186007.985   486,915  .382013257   R-squared       =    0.0828
-------------+----------------------------------   Adj R-squared   =    0.0828
       Total |  202803.743   486,925  .416498932   Root MSE        =    .61807

------------------------------------------------------------------------------
    LWKLYWGE | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        EDUC |   .0573383   .0002981   192.37   0.000     .0567541    .0579224
        YR20 |   .2510504   .0040846    61.46   0.000     .2430446    .2590561
        YR21 |   .2426493    .004078    59.50   0.000     .2346565    .2506421
        YR22 |   .2309454   .0038924    59.33   0.000     .2233165    .2385743
        YR23 |   .2186718   .0038606    56.64   0.000     .2111052    .2262385
        YR24 |   .1822308   .0039072    46.64   0.000     .1745728    .1898889
        YR25 |   .1538481   .0039026    39.42   0.000     .1461991    .1614972
        YR26 |   .1206861   .0037029    32.59   0.000     .1134286    .1279437
        YR27 |   .0851009   .0035969    23.66   0.000     .0780511    .0921508
        YR28 |   .0402911   .0036434    11.06   0.000       .03315    .0474321
       _cons |   4.878781   .0048444  1007.10   0.000     4.869286    4.888276
------------------------------------------------------------------------------

. reg  LWKLYWGE EDUC  YR20-YR28 AGEQ AGEQSQ 

      Source |       SS           df       MS      Number of obs   =   486,926
-------------+----------------------------------   F(12, 486913)   =   3668.22
       Model |  16814.1046        12  1401.17538   Prob > F        =    0.0000
    Residual |  185989.638   486,913  .381977146   R-squared       =    0.0829
-------------+----------------------------------   Adj R-squared   =    0.0829
       Total |  202803.743   486,925  .416498932   Root MSE        =    .61804

------------------------------------------------------------------------------
    LWKLYWGE | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        EDUC |   .0573461   .0002981   192.38   0.000     .0567619    .0579304
        YR20 |    .110682   .0292461     3.78   0.000     .0533606    .1680035
        YR21 |   .0991362   .0257848     3.84   0.000     .0485988    .1496737
        YR22 |   .0890475   .0230196     3.87   0.000     .0439299    .1341651
        YR23 |   .0828728   .0207946     3.99   0.000      .042116    .1236296
        YR24 |   .0574244   .0186061     3.09   0.002      .020957    .0938917
        YR25 |   .0446047   .0162411     2.75   0.006     .0127727    .0764367
        YR26 |   .0327306    .013272     2.47   0.014     .0067179    .0587434
        YR27 |   .0207241   .0100957     2.05   0.040     .0009369    .0405114
        YR28 |   .0059328   .0062818     0.94   0.345    -.0063793     .018245
        AGEQ |   .1799818   .0389345     4.62   0.000     .1036715    .2562922
      AGEQSQ |  -.0023404   .0005592    -4.19   0.000    -.0034364   -.0012444
       _cons |     1.5622   .6709312     2.33   0.020     .2471952    2.877204
------------------------------------------------------------------------------

. reg  LWKLYWGE EDUC  `controls' YR20-YR28

      Source |       SS           df       MS      Number of obs   =   486,926
-------------+----------------------------------   F(21, 486904)   =   3447.63
       Model |  26252.3155        21  1250.11026   Prob > F        =    0.0000
    Residual |  176551.427   486,904  .362600075   R-squared       =    0.1294
-------------+----------------------------------   Adj R-squared   =    0.1294
       Total |  202803.743   486,925  .416498932   Root MSE        =    .60216

------------------------------------------------------------------------------
    LWKLYWGE | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        EDUC |   .0520464   .0002971   175.19   0.000     .0514641    .0526287
        RACE |  -.2107128   .0032215   -65.41   0.000    -.2170268   -.2043988
     MARRIED |   .2445162   .0022017   111.06   0.000     .2402009    .2488314
        SMSA |  -.1418395   .0022877   -62.00   0.000    -.1463234   -.1373556
      NEWENG |  -.0925392   .0043444   -21.30   0.000    -.1010541   -.0840243
      MIDATL |  -.0143339   .0032692    -4.38   0.000    -.0207415   -.0079263
     ENOCENT |   .0428862   .0031058    13.81   0.000      .036799    .0489734
     WNOCENT |  -.0701283   .0039399   -17.80   0.000    -.0778503   -.0624063
       SOATL |  -.1050696   .0032102   -32.73   0.000    -.1113615   -.0987776
     ESOCENT |  -.1202768   .0041859   -28.73   0.000     -.128481   -.1120727
     WSOCENT |  -.0583213   .0036588   -15.94   0.000    -.0654924   -.0511502
          MT |  -.0674863   .0044884   -15.04   0.000    -.0762833   -.0586892
        YR20 |   .2239961   .0039853    56.21   0.000     .2161849    .2318072
        YR21 |   .2158427   .0039785    54.25   0.000     .2080449    .2236405
        YR22 |   .2031091   .0037979    53.48   0.000     .1956653    .2105529
        YR23 |   .1929448   .0037664    51.23   0.000     .1855627    .2003269
        YR24 |   .1619856   .0038101    42.51   0.000     .1545179    .1694532
        YR25 |   .1365743   .0038049    35.89   0.000     .1291169    .1440317
        YR26 |   .1049269   .0036098    29.07   0.000     .0978518     .112002
        YR27 |   .0731486   .0035057    20.87   0.000     .0662775    .0800196
        YR28 |   .0350116     .00355     9.86   0.000     .0280537    .0419695
       _cons |   4.853827   .0057009   851.41   0.000     4.842654    4.865001
------------------------------------------------------------------------------

. reg  LWKLYWGE EDUC  `controls' YR20-YR28 AGEQ AGEQSQ 

      Source |       SS           df       MS      Number of obs   =   486,926
-------------+----------------------------------   F(23, 486902)   =   3149.93
       Model |  26267.5972        23  1142.06944   Prob > F        =    0.0000
    Residual |  176536.145   486,902  .362570179   R-squared       =    0.1295
-------------+----------------------------------   Adj R-squared   =    0.1295
       Total |  202803.743   486,925  .416498932   Root MSE        =    .60214

------------------------------------------------------------------------------
    LWKLYWGE | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        EDUC |   .0520558   .0002971   175.21   0.000     .0514735    .0526382
        RACE |  -.2107622   .0032214   -65.43   0.000     -.217076   -.2044484
     MARRIED |   .2444055   .0022017   111.01   0.000     .2400903    .2487207
        SMSA |  -.1418543   .0022876   -62.01   0.000     -.146338   -.1373705
      NEWENG |  -.0926402   .0043443   -21.32   0.000    -.1011548   -.0841256
      MIDATL |  -.0143314   .0032691    -4.38   0.000    -.0207387   -.0079241
     ENOCENT |   .0429411   .0031057    13.83   0.000     .0368541    .0490281
     WNOCENT |   -.070033   .0039397   -17.78   0.000    -.0777548   -.0623113
       SOATL |  -.1050156   .0032101   -32.71   0.000    -.1113074   -.0987239
     ESOCENT |  -.1202851   .0041857   -28.74   0.000    -.1284889   -.1120812
     WSOCENT |   -.058082   .0036589   -15.87   0.000    -.0652533   -.0509108
          MT |  -.0675454   .0044882   -15.05   0.000    -.0763421   -.0587487
        YR20 |   .0875108   .0284969     3.07   0.002     .0316579    .1433638
        YR21 |   .0789526   .0251245     3.14   0.002     .0297093    .1281959
        YR22 |   .0697974   .0224299     3.11   0.002     .0258356    .1137592
        YR23 |   .0668501   .0202619     3.30   0.001     .0271373    .1065629
        YR24 |   .0472473   .0181292     2.61   0.009     .0117145      .08278
        YR25 |   .0369685   .0158246     2.34   0.019     .0059527    .0679842
        YR26 |   .0253141   .0129317     1.96   0.050    -.0000316    .0506598
        YR27 |    .015208   .0098365     1.55   0.122    -.0040714    .0344873
        YR28 |   .0042516   .0061205     0.69   0.487    -.0077443    .0162475
        AGEQ |   .1517973   .0379337     4.00   0.000     .0774484    .2261462
      AGEQSQ |  -.0019453   .0005448    -3.57   0.000    -.0030131   -.0008774
       _cons |   2.029773     .65369     3.11   0.002     .7485607    3.310985
------------------------------------------------------------------------------

. 
. 
. ** Col 2 4 6 8 ***
. ivregress 2sls LWKLYWGE YR20-YR28 (EDUC =  `qtr')

Instrumental-variables 2SLS regression            Number of obs   =    486,926
                                                  Wald chi2(10)   =    6974.38
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0827
                                                  Root MSE        =     .61809

------------------------------------------------------------------------------
    LWKLYWGE | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        EDUC |   .0552978   .0137563     4.02   0.000     .0283359    .0822597
        YR20 |   .2497603   .0096072    26.00   0.000     .2309305    .2685901
        YR21 |   .2415559   .0084228    28.68   0.000     .2250475    .2580643
        YR22 |   .2302052   .0063281    36.38   0.000     .2178023     .242608
        YR23 |   .2180262   .0058173    37.48   0.000     .2066244     .229428
        YR24 |   .1816571   .0054976    33.04   0.000      .170882    .1924321
        YR25 |   .1535557   .0043722    35.12   0.000     .1449863    .1621251
        YR26 |   .1206802   .0037033    32.59   0.000      .113422    .1279384
        YR27 |   .0852128   .0036752    23.19   0.000     .0780095    .0924161
        YR28 |    .040319   .0036484    11.05   0.000     .0331682    .0474698
       _cons |   4.906853   .1892754    25.92   0.000      4.53588    5.277826
------------------------------------------------------------------------------
Endogenous: EDUC
Exogenous:  YR20 YR21 YR22 YR23 YR24 YR25 YR26 YR27 YR28 QTR120 QTR121
            QTR122 QTR123 QTR124 QTR125 QTR126 QTR127 QTR128 QTR129 QTR220
            QTR221 QTR222 QTR223 QTR224 QTR225 QTR226 QTR227 QTR228 QTR229
            QTR320 QTR321 QTR322 QTR323 QTR324 QTR325 QTR326 QTR327 QTR328
            QTR329

. ivregress 2sls LWKLYWGE YR20-YR28 AGEQ AGEQSQ (EDUC =  `qtr')
note: QTR328 omitted because of collinearity.
note: QTR329 omitted because of collinearity.

Instrumental-variables 2SLS regression            Number of obs   =    486,926
                                                  Wald chi2(12)   =    6806.01
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0532
                                                  Root MSE        =     .62797

------------------------------------------------------------------------------
    LWKLYWGE | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        EDUC |   .0947986   .0222744     4.26   0.000     .0511415    .1384557
        YR20 |   .0819032    .034292     2.39   0.017     .0146921    .1491143
        YR21 |   .0786832   .0288849     2.72   0.006       .02207    .1352965
        YR22 |   .0726292   .0253455     2.87   0.004     .0229529    .1223055
        YR23 |   .0733603   .0218729     3.35   0.001     .0304902    .1162304
        YR24 |   .0540045   .0190141     2.84   0.005     .0167375    .0912716
        YR25 |   .0418359    .016584     2.52   0.012     .0093319    .0743399
        YR26 |   .0291722   .0136503     2.14   0.033     .0024181    .0559264
        YR27 |    .017611   .0104236     1.69   0.091    -.0028189    .0380409
        YR28 |   .0056629   .0063848     0.89   0.375     -.006851    .0181768
        AGEQ |   .1325373    .048591     2.73   0.006     .0373007    .2277738
      AGEQSQ |   -.001582   .0007254    -2.18   0.029    -.0030038   -.0001602
       _cons |   1.788557   .6948771     2.57   0.010     .4266227    3.150491
------------------------------------------------------------------------------
Endogenous: EDUC
Exogenous:  YR20 YR21 YR22 YR23 YR24 YR25 YR26 YR27 YR28 AGEQ AGEQSQ QTR120
            QTR121 QTR122 QTR123 QTR124 QTR125 QTR126 QTR127 QTR128 QTR129
            QTR220 QTR221 QTR222 QTR223 QTR224 QTR225 QTR226 QTR227 QTR228
            QTR229 QTR320 QTR321 QTR322 QTR323 QTR324 QTR325 QTR326 QTR327

. ivregress 2sls LWKLYWGE YR20-YR28 `controls' (EDUC =  `qtr')

Instrumental-variables 2SLS regression            Number of obs   =    486,926
                                                  Wald chi2(21)   =   41560.34
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1261
                                                  Root MSE        =     .60329

------------------------------------------------------------------------------
    LWKLYWGE | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        EDUC |   .0392721   .0144917     2.71   0.007     .0108689    .0676752
        YR20 |   .2159624   .0099482    21.71   0.000     .1964644    .2354605
        YR21 |   .2090259   .0086986    24.03   0.000      .191977    .2260749
        YR22 |   .1982641   .0066839    29.66   0.000     .1851639    .2113644
        YR23 |   .1887218   .0060976    30.95   0.000     .1767708    .2006728
        YR24 |   .1582408   .0057106    27.71   0.000     .1470482    .1694334
        YR25 |    .134654   .0043903    30.67   0.000     .1260491    .1432589
        YR26 |   .1046187   .0036334    28.79   0.000     .0974973    .1117401
        YR27 |    .073587   .0035473    20.74   0.000     .0666344    .0805395
        YR28 |   .0351145   .0035586     9.87   0.000     .0281399    .0420892
        RACE |  -.2266122   .0183196   -12.37   0.000    -.2625179   -.1907065
     MARRIED |   .2442122   .0022326   109.39   0.000     .2398364     .248588
        SMSA |  -.1535466   .0134745   -11.40   0.000    -.1799562    -.127137
      NEWENG |  -.0967104   .0064286   -15.04   0.000    -.1093101   -.0841107
      MIDATL |  -.0204337   .0076545    -2.67   0.008    -.0354363   -.0054311
     ENOCENT |   .0326842   .0119822     2.73   0.006     .0091996    .0561688
     WNOCENT |  -.0755498    .007307   -10.34   0.000    -.0898712   -.0612284
       SOATL |  -.1157321   .0125137    -9.25   0.000    -.1402586   -.0912056
     ESOCENT |  -.1361323   .0184657    -7.37   0.000    -.1723245   -.0999401
     WSOCENT |   -.066576   .0100545    -6.62   0.000    -.0862823   -.0468696
          MT |  -.0678943   .0045205   -15.02   0.000    -.0767544   -.0590343
       _cons |   5.040699   .2120262    23.77   0.000     4.625135    5.456262
------------------------------------------------------------------------------
Endogenous: EDUC
Exogenous:  YR20 YR21 YR22 YR23 YR24 YR25 YR26 YR27 YR28 RACE MARRIED SMSA
            NEWENG MIDATL ENOCENT WNOCENT SOATL ESOCENT WSOCENT MT QTR120
            QTR121 QTR122 QTR123 QTR124 QTR125 QTR126 QTR127 QTR128 QTR129
            QTR220 QTR221 QTR222 QTR223 QTR224 QTR225 QTR226 QTR227 QTR228
            QTR229 QTR320 QTR321 QTR322 QTR323 QTR324 QTR325 QTR326 QTR327
            QTR328 QTR329

. ivregress 2sls LWKLYWGE YR20-YR28 `controls' AGEQ AGEQSQ (EDUC =  `qtr')
note: QTR328 omitted because of collinearity.
note: QTR329 omitted because of collinearity.

Instrumental-variables 2SLS regression            Number of obs   =    486,926
                                                  Wald chi2(23)   =   41126.10
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1160
                                                  Root MSE        =     .60678

------------------------------------------------------------------------------
    LWKLYWGE | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        EDUC |   .0778826   .0238715     3.26   0.001     .0310954    .1246698
        YR20 |   .0694171   .0332305     2.09   0.037     .0042866    .1345477
        YR21 |   .0661267   .0279557     2.37   0.018     .0113345     .120919
        YR22 |   .0598046   .0244168     2.45   0.014     .0119486    .1076607
        YR23 |   .0612154   .0210718     2.91   0.004     .0199154    .1025154
        YR24 |   .0454757   .0183421     2.48   0.013     .0095258    .0814257
        YR25 |   .0353146   .0160196     2.20   0.027     .0039166    .0667125
        YR26 |    .023348   .0131574     1.77   0.076    -.0024401    .0491361
        YR27 |   .0134793   .0100403     1.34   0.179    -.0061993    .0331579
        YR28 |   .0041181   .0061688     0.67   0.504    -.0079725    .0162088
        RACE |  -.1786469   .0298586    -5.98   0.000    -.2371686   -.1201251
     MARRIED |   .2450112   .0022881   107.08   0.000     .2405265    .2494958
        SMSA |  -.1181921   .0219902    -5.37   0.000    -.1612921   -.0750921
      NEWENG |  -.0842086   .0089381    -9.42   0.000     -.101727   -.0666902
      MIDATL |  -.0019903   .0118721    -0.17   0.867    -.0252592    .0212786
     ENOCENT |   .0635788   .0193288     3.29   0.001     .0256951    .1014625
     WNOCENT |  -.0590536   .0108963    -5.42   0.000    -.0804101   -.0376972
       SOATL |  -.0834592   .0201838    -4.13   0.000    -.1230187   -.0438998
     ESOCENT |  -.0882368   .0299185    -2.95   0.003    -.1468759   -.0295976
     WSOCENT |  -.0413564   .0158918    -2.60   0.009    -.0725038   -.0102091
          MT |  -.0667398   .0045836   -14.56   0.000    -.0757236    -.057756
        AGEQ |   .1214843    .047391     2.56   0.010     .0285996    .2143689
      AGEQSQ |  -.0014594   .0007092    -2.06   0.040    -.0028495   -.0000694
       _cons |   2.124584    .664514     3.20   0.001     .8221601    3.427007
------------------------------------------------------------------------------
Endogenous: EDUC
Exogenous:  YR20 YR21 YR22 YR23 YR24 YR25 YR26 YR27 YR28 RACE MARRIED SMSA
            NEWENG MIDATL ENOCENT WNOCENT SOATL ESOCENT WSOCENT MT AGEQ
            AGEQSQ QTR120 QTR121 QTR122 QTR123 QTR124 QTR125 QTR126 QTR127
            QTR128 QTR129 QTR220 QTR221 QTR222 QTR223 QTR224 QTR225 QTR226
            QTR227 QTR228 QTR229 QTR320 QTR321 QTR322 QTR323 QTR324 QTR325
            QTR326 QTR327

. 
. restore

. log close
      name:  <unnamed>
       log:  C:/Users/chadi/Dropbox/Applied-Economics/AK91/AK91/Analysis/Output/TableVI.log
  log type:  text
 closed on:  19 Sep 2024, 10:53:54
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
